# Задание 1
print("Квадрат числа 7 :" , 7 ** 2)

# Задание 2
print("Остаток от деления : " , 27 % 4)

#  Задание 3
print("Результат старого деление : " , 100 // 7)

#  Задание 4
a = 5
b = 7
result = (5 + 7)
print("Ответ:" , result)

# Задание 5
a = 10
h = 5
result = (a * h) + 1/2
print("Ответ:"   , result)

#  Задание 6
a = 5
b = 7
c = 3
result = (5 + 7 + 3) / 3
print("Среднее значение: " , result)

# Задание 7
# name = input("Введите имя :")
# surname = input("Введите фамилию :")
# result = name + surname
# print("Привет ,", result )

# Задание 8
word1 = input("Введите первое слово :")
word2 = input("Введите второе слово :")
result = word1 + word2
print("Конкатенация слов : ",  result)